app/models/user.rb

  def reset_session_token!
    self.update!(session_token: User.generate_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "1H32P80dEu59h2zLqt2JbA"], ["updated_at", "2019-07-30 18:50:10.311584"], ["id", 5]]